In [1]:
import numpy as np

import pandas as pd

In [2]:
df=pd.read_csv("disney movie total gross.csv")

In [3]:
df.tail()

,Movie Title,Date Released,Genre,MPAA Rating,Total Gross,Inflation Adjusted Gross
574,The Light Between Oceans,02/09/2016,Drama,PG-13,12545979,12545979
575,Queen of Katwe,23/09/2016,Drama,PG,8874389,8874389
576,Doctor Strange,04/11/2016,Adventure,PG-13,232532923,232532923
577,Moana,23/11/2016,Adventure,PG,246082029,246082029
578,Rogue One: A Star Wars Story,16/12/2016,Adventure,PG-13,529483936,529483936

In [4]:
df.head()

,Movie Title,Date Released,Genre,MPAA Rating,Total Gross,Inflation Adjusted Gross
0,Snow White and the Seven Dwarfs,21/12/1937,Musical,G,184925485,5228953251
1,Pinocchio,09/02/1940,Adventure,G,84300000,2188229052
2,Fantasia,13/11/1940,Musical,G,83320000,2187090808
3,Song of the South,12/11/1946,Adventure,G,65000000,1078510579
4,Cinderella,15/02/1950,Drama,G,85000000,920608730

In [5]:
df = pd.Series([1, 3, 5, np.nan, 6, 8])

In [6]:
series

NameError: name 'series' is not defined

In [7]:
df= pd.Series([1, 3, 5])

In [8]:
dates = pd.date_range("19350101", periods=10)

In [9]:
dates

DatetimeIndex(['1935-01-01', '1935-01-02', '1935-01-03', '1935-01-04',
               '1935-01-05', '1935-01-06', '1935-01-07', '1935-01-08',
               '1935-01-09', '1935-01-10'],
              dtype='datetime64[ns]', freq='D')

In [21]:
df = pd.DataFrame(
    {
        "movietitle": "snow white","cinderalla"
        "B": pd.Timestamp("20130102"),
        "Genre": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["Musical", "Adventure", "Musical", "drama"]),
        "F": "film",
    }
)

In [22]:
df

   movietitle cinderallaB  Genre  D          E     F
0  snow white  2013-01-02    1.0  3    Musical  film
1  snow white  2013-01-02    1.0  3  Adventure  film
2  snow white  2013-01-02    1.0  3    Musical  film
3  snow white  2013-01-02    1.0  3      drama  film

In [20]:
df

   movietitle          B  Genre  D          E     F
0  snow white 2013-01-02    1.0  3    Musical  film
1  snow white 2013-01-02    1.0  3  Adventure  film
2  snow white 2013-01-02    1.0  3    Musical  film
3  snow white 2013-01-02    1.0  3      drama  film

In [11]:
dataframe

NameError: name 'dataframe' is not defined

In [12]:
df

   movietitle          B  Genre  D      E     F
0         1.0 2013-01-02    1.0  3   test  film
1         1.0 2013-01-02    1.0  3  train  film
2         1.0 2013-01-02    1.0  3   test  film
3         1.0 2013-01-02    1.0  3  train  film

In [13]:
df.index

Index([0, 1, 2, 3], dtype='int64')

In [14]:

df.columns

Index(['movietitle', 'B', 'Genre', 'D', 'E', 'F'], dtype='object')

In [15]:
df[0:39]

   movietitle          B  Genre  D      E     F
0         1.0 2013-01-02    1.0  3   test  film
1         1.0 2013-01-02    1.0  3  train  film
2         1.0 2013-01-02    1.0  3   test  film
3         1.0 2013-01-02    1.0  3  train  film